[
  {
    "id": "clackd",
    "title": "Clackd",
    "description": "The hub for mechanical keyboards.",
    "coverPhotoSrc": "/assets/images/clackd/clackd_cover.png"
  },
  {
    "id": "credera",
    "title": "Credera",
    "description": "Unlock extraordinary.",
    "overview": "Although we're proud of the quality of work we provide at Credera, it became evident that our brand and image did not match that output. Our team worked to redefine how to present and message ourselves to new and existing clients. The Credera rebrand launched in the Summer of 2020.",
    "role": [
      "Website design",
      "Design system creation",
      "Brand guidelines creation",
      "Design leadership + mentorship"
    ],
    "more": "During the rebranding process, I crafted the website's visual interface and experience design. Page content, information hierarchy, and visual identity were my major focuses in producing final design elements. I also standardized web components into a design system and branding guide and found opportunities to lead and mentor junior designers.",
    "coverPhotoSrc": "/assets/images/credera/credera_cover.png",
    "photoLayout": 2,
    "photos": [
      {
        "src": "/assets/images/credera/home.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/credera/style_guide.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/credera/services.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/credera/our_firm.png",
        "displayBorder": true
      }
    ]
  },
  {
    "id": "wff",
    "title": "WFF",
    "description": "Connect. Grow. Inspire.",
    "overview": "WFF is an organization that aims to help women in the food service industry advance in their career. Prior to this application, WFF did not have an easy method to allow members to connect, learn, and grow. I came aboard to envision what this solution could look like and helped design and develop the entire web portal experience.",
    "role": [
      "Design sprint facilitator",
      "Application design + development"
    ],
    "more": "One of my biggest takeaways from this project was the value of user testing and feedback. The platform was rich with many features that all started from assumptions provided by WFF, as well as assumptions I had created myself. But all of these ideas were meaningless unless we put them in front of real members to gather their thoughts and reactions. Throughout the course of designing the application, I conducted weekly testing sessions to better understand my users and to ensure that my time spent creating this solution would solve members' problems.",
    "coverPhotoSrc": "/assets/images/wff/wff_cover.png",
    "photoLayout": 2,
    "photos": [
      {
        "src": "/assets/images/wff/overview.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/wff/events.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/wff/news.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/wff/company_engagement.png",
        "displayBorder": true
      },
      {
        "src": "/assets/images/wff/key_contacts.png",
        "displayBorder": true
      }
    ]
  }
] 